app/controllers/movies_controller.rb

  def similar_movies
    @movie = Movie.find(params[:id])
    director = @movie.director
    redirect_to movies_path, notice: "'#{@movie.title}' has no director info" and return if director.blank?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "wein"]]